tap "homebrew/cask"
tap "adoptopenjdk/openjdk"

cask "xquartz"
cask "clashx"
cask "adoptopenjdk8"
cask "iterm2"
cask "macdown"
cask "sublime-text"
cask "google-chrome"
cask "iina"
cask "the-unarchiver"
cask "insomnia"
cask "pdf-expert"
cask "sequel-pro"
cask "bochs"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "docker"

