tap "homebrew/cask"
tap "homebrew/services"

# App
brew "tmux"
brew "tig"
brew "tree"
brew "wget"
brew "vim"
brew "fish"
brew "ffmpeg"

cask "iterm2"
cask "macdown"
cask "visual-studio-code"
cask "sequel-ace"
cask "insomnia"
cask "iina"
cask "the-unarchiver"
cask "charles"
cask "xquartz"

# Dev
tap "adoptopenjdk/openjdk"
cask "adoptopenjdk11"
cask "virtualbox"
cask "vagrant"
cask "docker"
brew "nginx"
brew "mysql"
brew "postgresql@14"
brew "redis"

# fish_add_path /usr/local/opt/node@18/bin
brew "node@18"

# fish_add_path /usr/local/opt/ruby@3.1/bin
# fish_add_path /usr/local/lib/ruby/gems/3.1.0/bin
brew "ruby@3.1"

# fish_add_path /usr/local/opt/python@3.11/libexec/bin
brew "python@3.10"

# fish_add_path /usr/local/opt/php@8.1/bin
# fish_add_path /usr/local/opt/php@8.1/sbin
brew "php@8.1"

# Spakce
cask "mqttx"
cask "adrive"
cask "wechat"
cask "tencent-meeting"
cask "todesk"
cask "google-chrome"
